catalog=
[{
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "3D Creations",
	"Course_Name": "3D Modeling ",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 an up",
	"Prerequisite": "none",
	"Course_Description": "Make your own 3D creations! Students will learn cutting-edge technologies skills and professional-level software tools to model, sculpt, texture, arrange and render their own 3D modeling projects. Their finish product will be a 3D scene that includes characters, cars, buildings and props.",
	"Image": "3dmodeling.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "3D Creations",
	"Course_Name": "Introduction to 3D Printing ",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Welcome to 3D printing … the technology that will change the way we live!  You will learn about different 3D printing methods, materials and software. Instructor will guide the students in creating 3D models using simple design software that are free, accessible and easy to learn. At the completion of the course, every student will have at least one 3D object from their projects to take home. We will show students how to how to order online any of the objects from their projects. ",
	"Image": "3dcreations.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Animation",
	"Course_Name": "Brickfilms",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "7 and up",
	"Prerequisite": "none",
	"Course_Description": "Lights…Camera…Action! Students’ dream of having their favorite LEGO® characters come to life become a reality in our movie making class. Using stop-motion animation and digital post-production editing, students produce LEGO® Brickfilms much like the ones viewed on YouTube. Students learn about developing creative storytelling techniques, incorporating visual and audio special effects. This is a great class to take with friends. Students can take the class as many times as they like. ",
	"Image": "brickfilms.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Animation",
	"Course_Name": "3D Animation",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 and up",
	"Prerequisite": "none",
	"Course_Description": "Create your own 3D animated movie, like the movies on the big screen! Students start with a completely static scene and bring it to life using a 3D animation software tool. In the process, students will learn the fundamentals of moving objects in a 3D space, animating characters, and editing keyframes along a timeline. Not only the students will come away with an impressive project, but also with a foundational knowledge of a professional skill. ",
	"Image": "3danimation.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Animation",
	"Course_Name": "2D Anime Studio",
	"Course_Length": "full-day",
	"Course_Suffix": "New",
	"Age": "9 and up",
	"Prerequisite": "none",
	"Course_Description": "Bring your imagination to life! Anime Studio is your complete animation program for creating 2D movies, cartoons, anime and cut out animations. Create your own desktop animated shorts in the style of Nickelodeon, Cartoon Network Studios, Disney Animation Studios or use it to produce animations for film, video, commercials or streaming over the web.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "App Development",
	"Course_Name": "App Inventor",
	"Course_Length": "full-day",
	"Course_Suffix": "New",
	"Age": "9 and up",
	"Prerequisite": "Experience with computers",
	"Course_Description": "Make your first mobile app using the  MIT App Inventor software, which is an innovative beginner's introduction to programming and app creation that transforms the complex language of text-based coding into visual, drag-and-drop building blocks. You do not need to own a smart phone or tablet to take the class.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Digital Graphics",
	"Course_Name": "Crafty Graphic Design",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "This course will inspire the students to discover their inner-crafter, and create customized gifts Students will design graphics to be printed on various products, and go home with their finished projects. The design skills learnt from these projects are transferable to many other products. Some samples products are greeting cards, buttons, magnets, keychains, bookmarks, bags, mousepads and tshirts.",
	"Image": "craftygraphics.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Digital Graphics",
	"Course_Name": "Photo Comics Creation",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Does your child have a great idea for a comic book or a graphic novel? Students will have fun turning photos of their friends and themselves into the cartoons and being the stars of a comic story. They will create comics using a web camera, photo-editing software, images and templates. Student will learn photo editing software techniques such as converting photos into cartoons, creating background images, adding lighting, editing text bubbles and many more. The important skills of thinking through a storyline; planning and creating the characters; and writing a plot with dialogue; are all taught in an exciting and stimulating environment.",
	"Image": "photocomics.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Electronics",
	"Course_Name": "Electronic Gizmos",
	"Course_Length": "half-day",
	"Course_Suffix": "New",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "The Gizmos & Gadgets Kit is the ultimate invention toolbox. Motors, wheels, lights, switches, servos, buzzers, even the tools to build a remote control – snap it all together to spark creativity and fun. Want to invent a remote control racecar? Create an automatic bubble blowing device? Make a wireless doorbell, a bumper ball game, even a mischief machine to scare the pants off friends and family.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "Microsoft ® Kodu Game Lab",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Microsoft’s Kodu gives users control of powerful programming tools using simple graphical commands. Students will create 3-D worlds, add characters, and then make them interact or complete tasks. They will learn the different logic required if their character is on land, in the air, or under water.  Students will also program scoring, spawning characters, enemy objects, timers, health and various game levels. Based on “when something happens”, “do something” logic, students analyze problems and structure their solutions.",
	"Image": "kodugamelab.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "Game Creation - Arcade",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Students create their own customized functional arcade-style using Game Maker® software. This class will create game elements such as the player, enemies, bonuses, levels, lives, and program object movements. In addition to having fun and gaining a sense of accomplishment, students learn about programming logic, drag-and-drop programming; logical functions such as repeat loops, conditional statements and variables.",
	"Image": "gamecreationarcade.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "Game Creation - Pacman",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "PacMan is among one of the most popular arcade-style video games that appeas to young and old, as well as both genders. Students will create maze games that will focus on the strategies for good quality games for the appropriate age and difficulty level.  In additional to implementing strategies, and learning the basic software skills , students will learn about designing a splash page, changing sprite during the game, reversing directions, moving to new level based on scores.",
	"Image": "gcpacman.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "Advanced Game Maker - Platform ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with GameMaker",
	"Course_Description": "Learn the foundation of platform games such as the classic Super Mario and Sonic the Hedgehog. Students will examine gravity, drawbridges, platforms, bosses, levels, effects, and learn how to keep expanding their skills on game design as well as programming logic. ",
	"Image": "agcplatform.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "Advanced Game Maker - RPG (Role Playing Game)",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with GameMaker",
	"Course_Description": "You will learn to create a role playing game (RPG). Through the creation of a fantasy game, students will learn about level design, projectiles, enemy behavior, special effects, and narratives in the context of a game. Students will expand their creativity, and technical knowledge to create  a game of larger scale and more depth.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Game Design",
	"Course_Name": "3D Game Design",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 and up",
	"Prerequisite": "Familiar with gamemaking software",
	"Course_Description": "In this course, students learn the fundamentals of 3D game design;  how to create dynamic 3D environments from scratch. Students operate on the X, Y & Z axis, and adjust textures, material and lighting, to design a world of their imagination. Throughout the course, we encourage students to use creativity, while also stressing fundamental principles of 3D game design. At the end of the course, students will have a finished 3D game that they can share with family and friends.",
	"Image": "gcrpg.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft® Survival ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Students will navigate the Minecraft world, collaborate and communicate with each other to explore, complete quests, strategize and build creations. They will practice digital citizenship, creative thinking, teamwork and problem solving skills. Laptops are networked without internet access so that students can learn and have fun with each other in a safe “cyber” environment. Network , server and application concepts will also be discussed.",
	"Image": "mcsurvival.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft® Building Wonders",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "Students will learn about some famous monuments in the world. Utilizing various blocks, ores, crafted items, tools, students are challenged to replicate a famous structure and then design their own structure with some real and/or made-up fun facts. Teachers will provide tips and tricks on building better structures in Minecraft. This class maybe taken more than once, because different structure types from different geographical location and/or time period will be discussed.",
	"Image": "mcwonders.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft&reg; Machine Marvels ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "Students will create contraptions with items such as pistons, pressure-plates, levels, buttons, trip wire, lava, water, doors, dispenser, TNT and redstone. The teacher will provide guidelines on how to build some simple machines. These simple machines will be connected to create an entertaining “Rube Goldberg” machine. In addition to learning about action and reaction, transfer of energy, this course will also showcase the students’ logical ability as well as creativity. ",
	"Image": "mcmarvels.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft&reg; Mini-Game Invention",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "You will be creating interactive mini-games in Minecraft.  Instructor will guide the students in creating simple mini-games such as Mob Bowling, Pig Racing, Connect Four, to more complicated mini games such as Roller Coasters and Castle Wars. Students will design, plan, build, test, evaluate, and redesign or deploy the mini-games. They will be having so much fun that they do not know that they are practicing the app development lifecycle.",
	"Image": "mcminigames.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft&reg; Mod Programming",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "You will design and code your own Mod for Minecraft. The Mod includes swords, tools, blocks, foods, biomes, achievements and mobs,  that can be played and shared with friends! Students will design the graphics, and then modify Java codes to program their features. Students learn important concepts of object-oriented computer programming, such as how to instantiate new objects, call methods, define parameter and run loops. ",
	"Image": "mcmodprog.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft&reg; Mod Creator",
	"Course_Length": "full-day",
	"Course_Suffix": "New",
	"Age": "8 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "MCreator is a program for modding Minecraft without programing knowledge. It's very simple to use, and the program's concept is easy to learn. With MCreator, you can customise Minecraft as you wish. Creating new blocks, items, achievements, new types of existing blocks, mobs, biomes, foods, tools, plants, machines (and more!) is possible with MCreator.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Minecraft",
	"Course_Name": "Minecraft&reg; Server Design",
	"Course_Length": "full-day",
	"Course_Suffix": "New",
	"Age": "9 and up",
	"Prerequisite": "Experience with Minecraft",
	"Course_Description": "Create your own custom Minecraft server. Youth Digital's most awaited course, Server Design 1, is available now! Kids ages 8 - 14 can learn professional Java programming as they design and build their own customized Minecraft server and share with friends.",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Programming",
	"Course_Name": "Learn to Code with Scratch Jr ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "5 to 7",
	"Prerequisite": "none",
	"Course_Description": "ScratchJr&reg; is an introductory programming language that encourages creativity and expression by enabling young children to create their own interactive projects. Using ScratchJr, children can snap together programming blocks to make characters move, jump, dance, and sing. They can modify how their characters look, design their own backgrounds, add their own voices and sounds and even photos of themselves, and then use the programming blocks to bring their characters to life. ",
	"Image": null
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Programming",
	"Course_Name": "Introduction to Scratch&reg; Programming",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Scratch® is a programming language  that was invented by the MIT Media Lab. Through the creation of interactive stories, animations, games, music and art, students will develop a foundation of programming concepts that will prepare them for higher level programming language in the future. Students will also learn to think creatively and reason systematically.",
	"Image": "introtoscratch.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Programming",
	"Course_Name": "Intermediate Scratch&reg; Programming ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "Experience with Scratch",
	"Course_Description": "Students will code more elaborate programs, and explore advanced topics such as the external device extensions ir integration with robots, integration with webcam, Makey Makey etc. Under the guidance of the teacher,  students will use of their newly acquired knowledge to build their innovative projects. ",
	"Image": "intermscratch.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Programming",
	"Course_Name": "Web Design - HTML & CSS  ",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 and up",
	"Prerequisite": "Comfortable with typing",
	"Course_Description": "This course teaches the students how to build a web site using HTML (Hyperlink Text Markup Language) and CSS (Cascaded Style Sheets). Students will earn about links, texts, images, styles and various elements of the language of HTML and CSS. The class will also discuss the internet, domain names, web server, web browser, internet service provider, tools to build websites.Concepts will be explained, examples will be provided, and activities will be assigned to reinforce the understanding of the concepts. The final project from the class will be a live website hosted on our server for a year.",
	"Image": "webdesign.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Programming",
	"Course_Name": "Introduction to Python&reg; Programming",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "9 and up",
	"Prerequisite": "Comfortable with typing",
	"Course_Description": "You will be coding in Python to create interesting programs from jokes, games (ie Hangman, Reversi) to artificial intelligence. Python has a gentle learning curve while still being a serious language that is used by programmers professionally. Student will learn to work with Python in its interactive mode and through the use of scripts. The software will be available for free.",
	"Image": "intropython.png"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Robotics",
	"Course_Name": "LEGO&reg; WEDO&reg; Robotics ",
	"Course_Length": "half-day",
	"Course_Suffix": "",
	"Age": "6 and 7",
	"Prerequisite": "none",
	"Course_Description": "Students are introduced to simple robotics through building models, and using a computer to program the model’s behavior. Through transforming the 2D instructions into building 3D models, students will increase spatial cognition, visualization abilities, and inferring skills. The programming component will encourage students to think logically to produce a specific action, all while having a great time with their LEGO® creations! Our robot models include drumming monkey, hungry alligator, roaring lion, ferris wheel, merry-go-round, crane, draw bridge, airplane and many other. \n*Students can take this course more than once, because we will be introducing some new projects. *Students do not take home the robots. Robots can be purchased from LEGO&reg;",
	"Image": "wedo.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Robotics",
	"Course_Name": "LEGO&reg; MINDSTORMS&reg; Robotics ",
	"Course_Length": "full-day",
	"Course_Suffix": "",
	"Age": "8 and up",
	"Prerequisite": "none",
	"Course_Description": "Students will learn in an intuitive, logical sequence starting with simple movements, adding sensors, and finally advanced decision-making capability. Through a multi-step obstacle course, Sumo robot and other challenges, students will learn an iterative approach to problem-solving and programming. Logic, technology and creativity are combined to provide hours of learning fun! \n*Students can take this course more than once, because we will be introducing some new projects. * Students do not take home the robots.Robots can be purchased from LEGO® ",
	"Image": "mindstorm.jpg"
}, {
	"Program_Name": "Summer Camp 2016",
	"Course_Categories": "Animation",
	"Course_Name": "3D Character Animation",
	"Course_Length": "full-day",
	"Course_Suffix": "New",
	"Age": "9 and up",
	"Prerequisite": "none",
	"Course_Description": "Character Animation is an exciting course that teaches how to create animated movies using their favorite Minecraft characters! With a focus on character animation concepts like facial expressions and biped animation, kids will learn key 3D animation concepts and skills to bring their Minecraft story to life.",
	"Image": null
}];